# Attendance Data

## Read the data from the attendance table and calculate an attendance percentage for each student. One half day is worth 50% of a full day, and 10 tardies is equal to one absence.

You should end up with something like this:

 name
 Billy    0.5250
 
 Jane     0.6875
 
 John     0.9125
 
 Sally    0.7625
  
 Name: grade, dtype: float64

In [1]:
#from env import get_connection
from env import username, hostname, password
import pandas as pd

In [2]:
def get_db_url(username, hostname, password, database):
    url = f'mysql+pymysql://{username}:{password}@{hostname}/{database}'
    return url

In [4]:
url = get_db_url(username, hostname, password, 'tidy_data')
#url = get_connection('tidy_data', user, host, password)

In [5]:
untidy_data = pd.read_sql('SELECT * FROM attendance', url)
untidy_data

,Unnamed: 0,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P